InformationRegisters/РеквизитыДляКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыДляКонтроля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уникален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыРеквизитовДляКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РеквизитыДляКонтроля/Ext/ManagerModule.bsl
Функция КонтролируемыеРеквизитыПроверкиЗаполнения(Знач ОбъектФормы) Экспорт
	
	МассивКонтролируемыхРеквизитов = Новый Массив;
	Запрос = Новый Запрос;	
	
	ТипДанных = ТипЗнч(ОбъектФормы.Ссылка);
	ИсточникМетаданные = ОбъектФормы.Ссылка.Метаданные();
		
	Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если ОбъектФормы.ЭтоГруппа Тогда
			Возврат МассивКонтролируемыхРеквизитов;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Справочник_Номенклатура", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Номенклатура);
		Справочник_Номенклатура_Вид = Неопределено;
		Если ЗначениеЗаполнено(ОбъектФормы.ВидНоменклатуры) Тогда
			Справочник_Номенклатура_Вид = НаборРеквизитовДляКонтроляПоВидуНоменклатуры(ОбъектФормы.ВидНоменклатуры);
		КонецЕсли;
		Запрос.УстановитьПараметр("Справочник_Номенклатура_Вид", Справочник_Номенклатура_Вид);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.ЗаполнятьОбязательно
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Номенклатура
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.ЗаполнятьОбязательно
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Номенклатура_Вид";
		
	ИначеЕсли ТипДанных = Тип("СправочникСсылка.Контрагенты") Тогда		
		
		Если ОбъектФормы.ЭтоГруппа Тогда
			Возврат МассивКонтролируемыхРеквизитов;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Справочник_Контрагенты", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Контрагенты);
		Справочник_Контрагенты_Вид = Неопределено;
		Если ЗначениеЗаполнено(ОбъектФормы.ВидКонтрагента) Тогда
			Справочник_Контрагенты_Вид = НаборРеквизитовДляКонтроляПоВидуКонтрагента(ОбъектФормы.ВидКонтрагента);
		КонецЕсли;		
		Запрос.УстановитьПараметр("Справочник_Контрагенты_Вид", Справочник_Контрагенты_Вид);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.ЗаполнятьОбязательно
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Контрагенты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.ЗаполнятьОбязательно
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Контрагенты_Вид";
		
	Иначе
		Возврат МассивКонтролируемыхРеквизитов;
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ СтрНайти(Выборка.ИмяРеквизита, "Контактная информация.") = 0 Тогда
			МассивКонтролируемыхРеквизитов.Добавить(Выборка.ИмяРеквизита);
			Продолжить;
		КонецЕсли;
		Реквизит = ИсточникМетаданные.Реквизиты.Найти(Выборка.ИмяРеквизита);
		Если Реквизит = Неопределено И НЕ Выборка.ИмяРеквизита = "Родитель" Тогда
			Продолжить;
		КонецЕсли;			
		МассивКонтролируемыхРеквизитов.Добавить(Выборка.ИмяРеквизита);
		
	КонецЦикла;
			
	Возврат МассивКонтролируемыхРеквизитов;
	
КонецФункции

Функция КонтролируемыеРеквизитыУникальности(ОбъектФормы) Экспорт
	
	МассивКонтролируемыхРеквизитов = Новый Массив;
	Запрос = Новый Запрос;
	
	ТипДанных = ТипЗнч(ОбъектФормы.Ссылка);
	ИсточникМетаданные = ОбъектФормы.Ссылка.Метаданные();
		
	Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если ОбъектФормы.ЭтоГруппа Тогда
			Возврат МассивКонтролируемыхРеквизитов;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Справочник_Номенклатура", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Номенклатура);
		Справочник_Номенклатура_Вид = Неопределено;
		Если ЗначениеЗаполнено(ОбъектФормы.ВидНоменклатуры) Тогда
			Справочник_Номенклатура_Вид = НаборРеквизитовДляКонтроляПоВидуНоменклатуры(ОбъектФормы.ВидНоменклатуры);
		КонецЕсли;
		Запрос.УстановитьПараметр("Справочник_Номенклатура_Вид", Справочник_Номенклатура_Вид);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита КАК ИмяРеквизита,
		|	РеквизитыДляКонтроля.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.Уникален
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Номенклатура
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита,
		|	РеквизитыДляКонтроля.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.Уникален
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Номенклатура_Вид";
		
	ИначеЕсли ТипДанных = Тип("СправочникСсылка.Контрагенты") Тогда		
		
		Если ОбъектФормы.ЭтоГруппа Тогда
			Возврат МассивКонтролируемыхРеквизитов;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Справочник_Контрагенты", Справочники.НаборыРеквизитовДляКонтроля.Справочник_Контрагенты);
		Справочник_Контрагенты_Вид = Неопределено;
		Если ЗначениеЗаполнено(ОбъектФормы.ВидКонтрагента) Тогда
			Справочник_Контрагенты_Вид = НаборРеквизитовДляКонтроляПоВидуКонтрагента(ОбъектФормы.ВидКонтрагента);
		КонецЕсли;		
		Запрос.УстановитьПараметр("Справочник_Контрагенты_Вид", Справочник_Контрагенты_Вид);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита КАК ИмяРеквизита,
		|	РеквизитыДляКонтроля.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.Уникален
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Контрагенты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеквизитыДляКонтроля.ИмяРеквизита,
		|	РеквизитыДляКонтроля.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДляКонтроля КАК РеквизитыДляКонтроля
		|ГДЕ
		|	РеквизитыДляКонтроля.Уникален
		|	И РеквизитыДляКонтроля.Объект = &Справочник_Контрагенты_Вид";
		
	Иначе
		Возврат МассивКонтролируемыхРеквизитов;
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ СтрНайти(Выборка.ИмяРеквизита, "Контактная информация.") = 0 Тогда
			МассивКонтролируемыхРеквизитов.Добавить(Новый Структура("ИмяРеквизита, ПредставлениеРеквизита", Выборка.ИмяРеквизита, Выборка.ПредставлениеРеквизита));
			Продолжить;
		КонецЕсли;
		
		Реквизит = ИсточникМетаданные.Реквизиты.Найти(Выборка.ИмяРеквизита);
		Если Реквизит = Неопределено И НЕ Выборка.ИмяРеквизита = "Родитель" Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.ИмяРеквизита = "Родитель" Тогда
			// для стандартного реквизита не будем проверять уникальность, даже если задано
			Продолжить;
		КонецЕсли;
		МассивКонтролируемыхРеквизитов.Добавить(Новый Структура("ИмяРеквизита, ПредставлениеРеквизита", Выборка.ИмяРеквизита, Выборка.ПредставлениеРеквизита));
		
	КонецЦикла;
			
	Возврат МассивКонтролируемыхРеквизитов;
	
КонецФункции

Функция НаборРеквизитовДляКонтроляПоВидуНоменклатуры(ВидНоменклатуры)
	
	ИмяВида = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.Предопределенный
		|	И ВидыНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидНоменклатуры);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ИмяВида = Выборка.ИмяПредопределенныхДанных;	
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяВида) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Справочник_Номенклатура_Вид = Справочники.НаборыРеквизитовДляКонтроля[ИмяВида];
		Возврат Справочник_Номенклатура_Вид;
	Исключение		
	КонецПопытки;
	
	Возврат Неопределено;
		
КонецФункции

Функция НаборРеквизитовДляКонтроляПоВидуКонтрагента(ВидКонтрагента)	
	
	ИндексЗначения = Перечисления.ВидКонтрагента.Индекс(ВидКонтрагента);
	ИмяВида = Метаданные.Перечисления.ВидКонтрагента.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Попытка
		Справочник_Контрагенты_Вид = Справочники.НаборыРеквизитовДляКонтроля[ИмяВида];
		Возврат Справочник_Контрагенты_Вид;
	Исключение		
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции
